MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4GNFDFG/mcu.h
/**
  * @brief Interrupt Control Register B
  */
typedef struct
{
       uint8_t  RESERVED0[16];
  __IO uint8_t  NIC00;             /*!< Non-maskable Interrupt B Control Register 00 */
       uint8_t  RESERVED1[79];
  __IO uint8_t  IMC000;            /*!< Interrupt B Mode Control Register 000        */
  __IO uint8_t  IMC001;            /*!< Interrupt B Mode Control Register 001        */
  __IO uint8_t  IMC002;            /*!< Interrupt B Mode Control Register 002        */
  __IO uint8_t  IMC003;            /*!< Interrupt B Mode Control Register 003        */
  __IO uint8_t  IMC004;            /*!< Interrupt B Mode Control Register 004        */
  __IO uint8_t  IMC005;            /*!< Interrupt B Mode Control Register 005        */
  __IO uint8_t  IMC006;            /*!< Interrupt B Mode Control Register 006        */
  __IO uint8_t  IMC007;            /*!< Interrupt B Mode Control Register 007        */
  __IO uint8_t  IMC008;            /*!< Interrupt B Mode Control Register 008        */
  __IO uint8_t  IMC009;            /*!< Interrupt B Mode Control Register 009        */
  __IO uint8_t  IMC010;            /*!< Interrupt B Mode Control Register 010        */
  __IO uint8_t  IMC011;            /*!< Interrupt B Mode Control Register 011        */
  __IO uint8_t  IMC012;            /*!< Interrupt B Mode Control Register 012        */
  __IO uint8_t  IMC013;            /*!< Interrupt B Mode Control Register 013        */
  __IO uint8_t  IMC014;            /*!< Interrupt B Mode Control Register 014        */
  __IO uint8_t  IMC015;            /*!< Interrupt B Mode Control Register 015        */
  __IO uint8_t  IMC016;            /*!< Interrupt B Mode Control Register 016        */
  __IO uint8_t  IMC017;            /*!< Interrupt B Mode Control Register 017        */
  __IO uint8_t  IMC018;            /*!< Interrupt B Mode Control Register 018        */
  __IO uint8_t  IMC019;            /*!< Interrupt B Mode Control Register 019        */
  __IO uint8_t  IMC020;            /*!< Interrupt B Mode Control Register 020        */
  __IO uint8_t  IMC021;            /*!< Interrupt B Mode Control Register 021        */
  __IO uint8_t  IMC022;            /*!< Interrupt B Mode Control Register 022        */
  __IO uint8_t  IMC023;            /*!< Interrupt B Mode Control Register 023        */
  __IO uint8_t  IMC024;            /*!< Interrupt B Mode Control Register 024        */
  __IO uint8_t  IMC025;            /*!< Interrupt B Mode Control Register 025        */
  __IO uint8_t  IMC026;            /*!< Interrupt B Mode Control Register 026        */
  __IO uint8_t  IMC027;            /*!< Interrupt B Mode Control Register 027        */
  __IO uint8_t  IMC028;            /*!< Interrupt B Mode Control Register 028        */
  __IO uint8_t  IMC029;            /*!< Interrupt B Mode Control Register 029        */
  __IO uint8_t  IMC030;            /*!< Interrupt B Mode Control Register 030        */
  __IO uint8_t  IMC031;            /*!< Interrupt B Mode Control Register 031        */
  __IO uint8_t  IMC032;            /*!< Interrupt B Mode Control Register 032        */
  __IO uint8_t  IMC033;            /*!< Interrupt B Mode Control Register 033        */
  __IO uint8_t  IMC034;            /*!< Interrupt B Mode Control Register 034        */
  __IO uint8_t  IMC035;            /*!< Interrupt B Mode Control Register 035        */
  __IO uint8_t  IMC036;            /*!< Interrupt B Mode Control Register 036        */
  __IO uint8_t  IMC037;            /*!< Interrupt B Mode Control Register 037        */
  __IO uint8_t  IMC038;            /*!< Interrupt B Mode Control Register 038        */
  __IO uint8_t  IMC039;            /*!< Interrupt B Mode Control Register 039        */
  __IO uint8_t  IMC040;            /*!< Interrupt B Mode Control Register 040        */
  __IO uint8_t  IMC041;            /*!< Interrupt B Mode Control Register 041        */
  __IO uint8_t  IMC042;            /*!< Interrupt B Mode Control Register 042        */
  __IO uint8_t  IMC043;            /*!< Interrupt B Mode Control Register 043        */
  __IO uint8_t  IMC044;            /*!< Interrupt B Mode Control Register 044        */
  __IO uint8_t  IMC045;            /*!< Interrupt B Mode Control Register 045        */
  __IO uint8_t  IMC046;            /*!< Interrupt B Mode Control Register 046        */
  __IO uint8_t  IMC047;            /*!< Interrupt B Mode Control Register 047        */
  __IO uint8_t  IMC048;            /*!< Interrupt B Mode Control Register 048        */
  __IO uint8_t  IMC049;            /*!< Interrupt B Mode Control Register 049        */
  __IO uint8_t  IMC050;            /*!< Interrupt B Mode Control Register 050        */
  __IO uint8_t  IMC051;            /*!< Interrupt B Mode Control Register 051        */
  __IO uint8_t  IMC052;            /*!< Interrupt B Mode Control Register 052        */
  __IO uint8_t  IMC053;            /*!< Interrupt B Mode Control Register 053        */
  __IO uint8_t  IMC054;            /*!< Interrupt B Mode Control Register 054        */
  __IO uint8_t  IMC055;            /*!< Interrupt B Mode Control Register 055        */
  __IO uint8_t  IMC056;            /*!< Interrupt B Mode Control Register 056        */
  __IO uint8_t  IMC057;            /*!< Interrupt B Mode Control Register 057        */
  __IO uint8_t  IMC058;            /*!< Interrupt B Mode Control Register 058        */
  __IO uint8_t  IMC059;            /*!< Interrupt B Mode Control Register 059        */
  __IO uint8_t  IMC060;            /*!< Interrupt B Mode Control Register 060        */
  __IO uint8_t  IMC061;            /*!< Interrupt B Mode Control Register 061        */
  __IO uint8_t  IMC062;            /*!< Interrupt B Mode Control Register 062        */
  __IO uint8_t  IMC063;            /*!< Interrupt B Mode Control Register 063        */
  __IO uint8_t  IMC064;            /*!< Interrupt B Mode Control Register 064        */
  __IO uint8_t  IMC065;            /*!< Interrupt B Mode Control Register 065        */
  __IO uint8_t  IMC066;            /*!< Interrupt B Mode Control Register 066        */
  __IO uint8_t  IMC067;            /*!< Interrupt B Mode Control Register 067        */
  __IO uint8_t  IMC068;            /*!< Interrupt B Mode Control Register 068        */
  __IO uint8_t  IMC069;            /*!< Interrupt B Mode Control Register 069        */
  __IO uint8_t  IMC070;            /*!< Interrupt B Mode Control Register 070        */
  __IO uint8_t  IMC071;            /*!< Interrupt B Mode Control Register 071        */
  __IO uint8_t  IMC072;            /*!< Interrupt B Mode Control Register 072        */
  __IO uint8_t  IMC073;            /*!< Interrupt B Mode Control Register 073        */
  __IO uint8_t  IMC074;            /*!< Interrupt B Mode Control Register 074        */
  __IO uint8_t  IMC075;            /*!< Interrupt B Mode Control Register 075        */
  __IO uint8_t  IMC076;            /*!< Interrupt B Mode Control Register 076        */
  __IO uint8_t  IMC077;            /*!< Interrupt B Mode Control Register 077        */
  __IO uint8_t  IMC078;            /*!< Interrupt B Mode Control Register 078        */
  __IO uint8_t  IMC079;            /*!< Interrupt B Mode Control Register 079        */
  __IO uint8_t  IMC080;            /*!< Interrupt B Mode Control Register 080        */
  __IO uint8_t  IMC081;            /*!< Interrupt B Mode Control Register 081        */
  __IO uint8_t  IMC082;            /*!< Interrupt B Mode Control Register 082        */
  __IO uint8_t  IMC083;            /*!< Interrupt B Mode Control Register 083        */
  __IO uint8_t  IMC084;            /*!< Interrupt B Mode Control Register 084        */
  __IO uint8_t  IMC085;            /*!< Interrupt B Mode Control Register 085        */
  __IO uint8_t  IMC086;            /*!< Interrupt B Mode Control Register 086        */
  __IO uint8_t  IMC087;            /*!< Interrupt B Mode Control Register 087        */
  __IO uint8_t  IMC088;            /*!< Interrupt B Mode Control Register 088        */
  __IO uint8_t  IMC089;            /*!< Interrupt B Mode Control Register 089        */
  __IO uint8_t  IMC090;            /*!< Interrupt B Mode Control Register 090        */
  __IO uint8_t  IMC091;            /*!< Interrupt B Mode Control Register 091        */
  __IO uint8_t  IMC092;            /*!< Interrupt B Mode Control Register 092        */
  __IO uint8_t  IMC093;            /*!< Interrupt B Mode Control Register 093        */
  __IO uint8_t  IMC094;            /*!< Interrupt B Mode Control Register 094        */
  __IO uint8_t  IMC095;            /*!< Interrupt B Mode Control Register 095        */
  __IO uint8_t  IMC096;            /*!< Interrupt B Mode Control Register 096        */
  __IO uint8_t  IMC097;            /*!< Interrupt B Mode Control Register 097        */
  __IO uint8_t  IMC098;            /*!< Interrupt B Mode Control Register 098        */
  __IO uint8_t  IMC099;            /*!< Interrupt B Mode Control Register 099        */
  __IO uint8_t  IMC100;            /*!< Interrupt B Mode Control Register 100        */
  __IO uint8_t  IMC101;            /*!< Interrupt B Mode Control Register 101        */
  __IO uint8_t  IMC102;            /*!< Interrupt B Mode Control Register 102        */
  __IO uint8_t  IMC103;            /*!< Interrupt B Mode Control Register 103        */
  __IO uint8_t  IMC104;            /*!< Interrupt B Mode Control Register 104        */
  __IO uint8_t  IMC105;            /*!< Interrupt B Mode Control Register 105        */
  __IO uint8_t  IMC106;            /*!< Interrupt B Mode Control Register 106        */
  __IO uint8_t  IMC107;            /*!< Interrupt B Mode Control Register 107        */
  __IO uint8_t  IMC108;            /*!< Interrupt B Mode Control Register 108        */
  __IO uint8_t  IMC109;            /*!< Interrupt B Mode Control Register 109        */
  __IO uint8_t  IMC110;            /*!< Interrupt B Mode Control Register 110        */
  __IO uint8_t  IMC111;            /*!< Interrupt B Mode Control Register 111        */
  __IO uint8_t  IMC112;            /*!< Interrupt B Mode Control Register 112        */
  __IO uint8_t  IMC113;            /*!< Interrupt B Mode Control Register 113        */
  __IO uint8_t  IMC114;            /*!< Interrupt B Mode Control Register 114        */
  __IO uint8_t  IMC115;            /*!< Interrupt B Mode Control Register 115        */
  __IO uint8_t  IMC116;            /*!< Interrupt B Mode Control Register 116        */
  __IO uint8_t  IMC117;            /*!< Interrupt B Mode Control Register 117        */
  __IO uint8_t  IMC118;            /*!< Interrupt B Mode Control Register 118        */
  __IO uint8_t  IMC119;            /*!< Interrupt B Mode Control Register 119        */
  __IO uint8_t  IMC120;            /*!< Interrupt B Mode Control Register 120        */
  __IO uint8_t  IMC121;            /*!< Interrupt B Mode Control Register 121        */
  __IO uint8_t  IMC122;            /*!< Interrupt B Mode Control Register 122        */
  __IO uint8_t  IMC123;            /*!< Interrupt B Mode Control Register 123        */
  __IO uint8_t  IMC124;            /*!< Interrupt B Mode Control Register 124        */
  __IO uint8_t  IMC125;            /*!< Interrupt B Mode Control Register 125        */
  __IO uint8_t  IMC126;            /*!< Interrupt B Mode Control Register 126        */
  __IO uint8_t  IMC127;            /*!< Interrupt B Mode Control Register 127        */
  __IO uint8_t  IMC128;            /*!< Interrupt B Mode Control Register 128        */
  __IO uint8_t  IMC129;            /*!< Interrupt B Mode Control Register 129        */
  __IO uint8_t  IMC130;            /*!< Interrupt B Mode Control Register 130        */
  __IO uint8_t  IMC131;            /*!< Interrupt B Mode Control Register 131        */
  __IO uint8_t  IMC132;            /*!< Interrupt B Mode Control Register 132        */
  __IO uint8_t  IMC133;            /*!< Interrupt B Mode Control Register 133        */
  __IO uint8_t  IMC134;            /*!< Interrupt B Mode Control Register 134        */
  __IO uint8_t  IMC135;            /*!< Interrupt B Mode Control Register 135        */
  __IO uint8_t  IMC136;            /*!< Interrupt B Mode Control Register 136        */
  __IO uint8_t  IMC137;            /*!< Interrupt B Mode Control Register 137        */
  __IO uint8_t  IMC138;            /*!< Interrupt B Mode Control Register 138        */
  __IO uint8_t  IMC139;            /*!< Interrupt B Mode Control Register 139        */
  __IO uint8_t  IMC140;            /*!< Interrupt B Mode Control Register 140        */
  __IO uint8_t  IMC141;            /*!< Interrupt B Mode Control Register 141        */
       uint8_t  RESERVED2[3];
  __IO uint8_t  IMC145;            /*!< Interrupt B Mode Control Register 145        */
  __IO uint8_t  IMC146;            /*!< Interrupt B Mode Control Register 146        */
  __IO uint8_t  IMC147;            /*!< Interrupt B Mode Control Register 147        */
  __IO uint8_t  IMC148;            /*!< Interrupt B Mode Control Register 148        */
  __IO uint8_t  IMC149;            /*!< Interrupt B Mode Control Register 149        */
  __IO uint8_t  IMC150;            /*!< Interrupt B Mode Control Register 150        */
  __IO uint8_t  IMC151;            /*!< Interrupt B Mode Control Register 151        */
  __IO uint8_t  IMC152;            /*!< Interrupt B Mode Control Register 152        */
  __IO uint8_t  IMC153;            /*!< Interrupt B Mode Control Register 153        */
  __IO uint8_t  IMC154;            /*!< Interrupt B Mode Control Register 154        */
  __IO uint8_t  IMC155;            /*!< Interrupt B Mode Control Register 155        */
  __IO uint8_t  IMC156;            /*!< Interrupt B Mode Control Register 156        */
  __IO uint8_t  IMC157;            /*!< Interrupt B Mode Control Register 157        */
  __IO uint8_t  IMC158;            /*!< Interrupt B Mode Control Register 158        */
  __IO uint8_t  IMC159;            /*!< Interrupt B Mode Control Register 159        */
} TSB_IB_TypeDef;

/**
  * @brief Interrupt Monitor Register
  */
typedef struct
{
  __I  uint32_t FLGNMI;            /*!< Non-maskable Interrupt Monitor Flag Register Register*/
  __I  uint32_t FLG1;              /*!< Interrupt Monitor Flag Register 1 (032 - 063)*/
  __I  uint32_t FLG2;              /*!< Interrupt Monitor Flag Register 2 (064 - 095)*/
  __I  uint32_t FLG3;              /*!< Interrupt Monitor Flag Register 3 (096 - 127)*/
  __I  uint32_t FLG4;              /*!< Interrupt Monitor Flag Register 4 (128 - 159)*/
  __I  uint32_t FLG5;              /*!< Interrupt Monitor Flag Register 5 (160 - 191)*/
  __I  uint32_t FLG6;              /*!< Interrupt Monitor Flag Register 6 (192 - 223)*/
  __I  uint32_t FLG7;              /*!< Interrupt Monitor Flag Register 7 (224 - 255)*/
} TSB_IMN_TypeDef;

/**
  * @brief DNF
  */
typedef struct
{
  __IO uint32_t CKCR;              /*!< DNF Unit A Noise Filter Control Register     */
  __IO uint32_t ENCR;              /*!< DNF Unit A Noise Filter Enable Register      */
} TSB_DNF_TypeDef;

/**
  * @brief Watchdog Timer (SIWDT)
  */
typedef struct
{
  __IO uint32_t PRO;               /*!< SIWDT Protect Register                       */
  __IO uint32_t EN;                /*!< SIWDT Enable Register                        */
  __O  uint32_t CR;                /*!< SIWDT Control Register                       */
  __IO uint32_t MOD;               /*!< SIWDT Mode Register                          */
  __I  uint32_t MONI;              /*!< SIWDT Count Monitor Register                 */
} TSB_SIWD_TypeDef;

/**
  * @brief NBDIF
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< NBDIF control register 0                     */
  __IO uint32_t CR1;               /*!< NBDIF control register 1                     */
} TSB_NBD_TypeDef;

