MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4GNFDFG/mcu.h
#define TSB_T32A12_MOD_MODE32                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->MOD,0)))
#define TSB_T32A12_MOD_HALT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->MOD,1)))
#define TSB_T32A12_RUNA_RUNA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNA,0)))
#define TSB_T32A12_RUNA_SFTSTAA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNA,1)))
#define TSB_T32A12_RUNA_SFTSTPA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNA,2)))
#define TSB_T32A12_RUNA_RUNFLGA                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNA,4)))
#define TSB_T32A12_CRA_WBFA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->CRA,20)))
#define TSB_T32A12_STA_INTA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STA,0)))
#define TSB_T32A12_STA_INTA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STA,1)))
#define TSB_T32A12_STA_INTOFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STA,2)))
#define TSB_T32A12_STA_INTUFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STA,3)))
#define TSB_T32A12_IMA_IMA0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMA,0)))
#define TSB_T32A12_IMA_IMA1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMA,1)))
#define TSB_T32A12_IMA_IMOFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMA,2)))
#define TSB_T32A12_IMA_IMUFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMA,3)))
#define TSB_T32A12_DMAA_DMAENA0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAA,0)))
#define TSB_T32A12_DMAA_DMAENA1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAA,1)))
#define TSB_T32A12_DMAA_DMAENA2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAA,2)))
#define TSB_T32A12_RUNB_RUNB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNB,0)))
#define TSB_T32A12_RUNB_SFTSTAB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNB,1)))
#define TSB_T32A12_RUNB_SFTSTPB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNB,2)))
#define TSB_T32A12_RUNB_RUNFLGB                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNB,4)))
#define TSB_T32A12_CRB_WBFB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->CRB,20)))
#define TSB_T32A12_STB_INTB0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STB,0)))
#define TSB_T32A12_STB_INTB1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STB,1)))
#define TSB_T32A12_STB_INTOFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STB,2)))
#define TSB_T32A12_STB_INTUFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STB,3)))
#define TSB_T32A12_IMB_IMB0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMB,0)))
#define TSB_T32A12_IMB_IMB1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMB,1)))
#define TSB_T32A12_IMB_IMOFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMB,2)))
#define TSB_T32A12_IMB_IMUFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMB,3)))
#define TSB_T32A12_DMAB_DMAENB0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAB,0)))
#define TSB_T32A12_DMAB_DMAENB1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAB,1)))
#define TSB_T32A12_DMAB_DMAENB2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAB,2)))
#define TSB_T32A12_RUNC_RUNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNC,0)))
#define TSB_T32A12_RUNC_SFTSTAC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNC,1)))
#define TSB_T32A12_RUNC_SFTSTPC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNC,2)))
#define TSB_T32A12_RUNC_RUNFLGC                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A12->RUNC,4)))
#define TSB_T32A12_CRC_WBFC                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->CRC,20)))
#define TSB_T32A12_STC_INTC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STC,0)))
#define TSB_T32A12_STC_INTC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STC,1)))
#define TSB_T32A12_STC_INTOFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STC,2)))
#define TSB_T32A12_STC_INTUFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STC,3)))
#define TSB_T32A12_STC_INTSTERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->STC,4)))
#define TSB_T32A12_IMC_IMC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMC,0)))
#define TSB_T32A12_IMC_IMC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMC,1)))
#define TSB_T32A12_IMC_IMOFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMC,2)))
#define TSB_T32A12_IMC_IMUFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMC,3)))
#define TSB_T32A12_IMC_IMSTERR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->IMC,4)))
#define TSB_T32A12_DMAC_DMAENC0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAC,0)))
#define TSB_T32A12_DMAC_DMAENC1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAC,1)))
#define TSB_T32A12_DMAC_DMAENC2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->DMAC,2)))
#define TSB_T32A12_PLSCR_PMODE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->PLSCR,0)))
#define TSB_T32A12_PLSCR_PDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A12->PLSCR,1)))

#define TSB_T32A13_MOD_MODE32                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->MOD,0)))
#define TSB_T32A13_MOD_HALT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->MOD,1)))
#define TSB_T32A13_RUNA_RUNA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNA,0)))
#define TSB_T32A13_RUNA_SFTSTAA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNA,1)))
#define TSB_T32A13_RUNA_SFTSTPA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNA,2)))
#define TSB_T32A13_RUNA_RUNFLGA                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNA,4)))
#define TSB_T32A13_CRA_WBFA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->CRA,20)))
#define TSB_T32A13_STA_INTA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STA,0)))
#define TSB_T32A13_STA_INTA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STA,1)))
#define TSB_T32A13_STA_INTOFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STA,2)))
#define TSB_T32A13_STA_INTUFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STA,3)))
#define TSB_T32A13_IMA_IMA0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMA,0)))
#define TSB_T32A13_IMA_IMA1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMA,1)))
#define TSB_T32A13_IMA_IMOFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMA,2)))
#define TSB_T32A13_IMA_IMUFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMA,3)))
#define TSB_T32A13_DMAA_DMAENA0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAA,0)))
#define TSB_T32A13_DMAA_DMAENA1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAA,1)))
#define TSB_T32A13_DMAA_DMAENA2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAA,2)))
#define TSB_T32A13_RUNB_RUNB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNB,0)))
#define TSB_T32A13_RUNB_SFTSTAB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNB,1)))
#define TSB_T32A13_RUNB_SFTSTPB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNB,2)))
#define TSB_T32A13_RUNB_RUNFLGB                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNB,4)))
#define TSB_T32A13_CRB_WBFB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->CRB,20)))
#define TSB_T32A13_STB_INTB0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STB,0)))
#define TSB_T32A13_STB_INTB1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STB,1)))
#define TSB_T32A13_STB_INTOFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STB,2)))
#define TSB_T32A13_STB_INTUFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STB,3)))
#define TSB_T32A13_IMB_IMB0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMB,0)))
#define TSB_T32A13_IMB_IMB1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMB,1)))
#define TSB_T32A13_IMB_IMOFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMB,2)))
#define TSB_T32A13_IMB_IMUFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMB,3)))
#define TSB_T32A13_DMAB_DMAENB0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAB,0)))
#define TSB_T32A13_DMAB_DMAENB1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAB,1)))
#define TSB_T32A13_DMAB_DMAENB2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAB,2)))
#define TSB_T32A13_RUNC_RUNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNC,0)))
#define TSB_T32A13_RUNC_SFTSTAC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNC,1)))
#define TSB_T32A13_RUNC_SFTSTPC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNC,2)))
#define TSB_T32A13_RUNC_RUNFLGC                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A13->RUNC,4)))
#define TSB_T32A13_CRC_WBFC                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->CRC,20)))
#define TSB_T32A13_STC_INTC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STC,0)))
#define TSB_T32A13_STC_INTC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STC,1)))
#define TSB_T32A13_STC_INTOFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STC,2)))
#define TSB_T32A13_STC_INTUFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STC,3)))
#define TSB_T32A13_STC_INTSTERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->STC,4)))
#define TSB_T32A13_IMC_IMC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMC,0)))
#define TSB_T32A13_IMC_IMC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMC,1)))
#define TSB_T32A13_IMC_IMOFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMC,2)))
#define TSB_T32A13_IMC_IMUFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMC,3)))
#define TSB_T32A13_IMC_IMSTERR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->IMC,4)))
#define TSB_T32A13_DMAC_DMAENC0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAC,0)))
#define TSB_T32A13_DMAC_DMAENC1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAC,1)))
#define TSB_T32A13_DMAC_DMAENC2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->DMAC,2)))
#define TSB_T32A13_PLSCR_PMODE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->PLSCR,0)))
#define TSB_T32A13_PLSCR_PDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A13->PLSCR,1)))

#define TSB_T32A14_MOD_MODE32                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->MOD,0)))
#define TSB_T32A14_MOD_HALT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->MOD,1)))
#define TSB_T32A14_RUNA_RUNA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNA,0)))
#define TSB_T32A14_RUNA_SFTSTAA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNA,1)))
#define TSB_T32A14_RUNA_SFTSTPA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNA,2)))
#define TSB_T32A14_RUNA_RUNFLGA                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNA,4)))
#define TSB_T32A14_CRA_WBFA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->CRA,20)))
#define TSB_T32A14_STA_INTA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STA,0)))
#define TSB_T32A14_STA_INTA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STA,1)))
#define TSB_T32A14_STA_INTOFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STA,2)))
#define TSB_T32A14_STA_INTUFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STA,3)))
#define TSB_T32A14_IMA_IMA0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMA,0)))
#define TSB_T32A14_IMA_IMA1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMA,1)))
#define TSB_T32A14_IMA_IMOFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMA,2)))
#define TSB_T32A14_IMA_IMUFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMA,3)))
#define TSB_T32A14_DMAA_DMAENA0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAA,0)))
#define TSB_T32A14_DMAA_DMAENA1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAA,1)))
#define TSB_T32A14_DMAA_DMAENA2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAA,2)))
#define TSB_T32A14_RUNB_RUNB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNB,0)))
#define TSB_T32A14_RUNB_SFTSTAB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNB,1)))
#define TSB_T32A14_RUNB_SFTSTPB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNB,2)))
#define TSB_T32A14_RUNB_RUNFLGB                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNB,4)))
#define TSB_T32A14_CRB_WBFB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->CRB,20)))
#define TSB_T32A14_STB_INTB0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STB,0)))
#define TSB_T32A14_STB_INTB1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STB,1)))
#define TSB_T32A14_STB_INTOFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STB,2)))
#define TSB_T32A14_STB_INTUFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STB,3)))
#define TSB_T32A14_IMB_IMB0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMB,0)))
#define TSB_T32A14_IMB_IMB1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMB,1)))
#define TSB_T32A14_IMB_IMOFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMB,2)))
#define TSB_T32A14_IMB_IMUFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMB,3)))
#define TSB_T32A14_DMAB_DMAENB0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAB,0)))
#define TSB_T32A14_DMAB_DMAENB1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAB,1)))
#define TSB_T32A14_DMAB_DMAENB2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAB,2)))
#define TSB_T32A14_RUNC_RUNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNC,0)))
#define TSB_T32A14_RUNC_SFTSTAC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNC,1)))
#define TSB_T32A14_RUNC_SFTSTPC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNC,2)))
#define TSB_T32A14_RUNC_RUNFLGC                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A14->RUNC,4)))
#define TSB_T32A14_CRC_WBFC                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->CRC,20)))
#define TSB_T32A14_STC_INTC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STC,0)))
#define TSB_T32A14_STC_INTC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STC,1)))
#define TSB_T32A14_STC_INTOFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STC,2)))
#define TSB_T32A14_STC_INTUFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STC,3)))
#define TSB_T32A14_STC_INTSTERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->STC,4)))
#define TSB_T32A14_IMC_IMC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMC,0)))
#define TSB_T32A14_IMC_IMC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMC,1)))
#define TSB_T32A14_IMC_IMOFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMC,2)))
#define TSB_T32A14_IMC_IMUFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMC,3)))
#define TSB_T32A14_IMC_IMSTERR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->IMC,4)))
#define TSB_T32A14_DMAC_DMAENC0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAC,0)))
#define TSB_T32A14_DMAC_DMAENC1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAC,1)))
#define TSB_T32A14_DMAC_DMAENC2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->DMAC,2)))
#define TSB_T32A14_PLSCR_PMODE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->PLSCR,0)))
#define TSB_T32A14_PLSCR_PDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A14->PLSCR,1)))

#define TSB_T32A15_MOD_MODE32                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->MOD,0)))
#define TSB_T32A15_MOD_HALT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->MOD,1)))
#define TSB_T32A15_RUNA_RUNA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNA,0)))
#define TSB_T32A15_RUNA_SFTSTAA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNA,1)))
#define TSB_T32A15_RUNA_SFTSTPA                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNA,2)))
#define TSB_T32A15_RUNA_RUNFLGA                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNA,4)))
#define TSB_T32A15_CRA_WBFA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->CRA,20)))
#define TSB_T32A15_STA_INTA0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STA,0)))
#define TSB_T32A15_STA_INTA1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STA,1)))
#define TSB_T32A15_STA_INTOFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STA,2)))
#define TSB_T32A15_STA_INTUFA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STA,3)))
#define TSB_T32A15_IMA_IMA0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMA,0)))
#define TSB_T32A15_IMA_IMA1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMA,1)))
#define TSB_T32A15_IMA_IMOFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMA,2)))
#define TSB_T32A15_IMA_IMUFA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMA,3)))
#define TSB_T32A15_DMAA_DMAENA0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAA,0)))
#define TSB_T32A15_DMAA_DMAENA1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAA,1)))
#define TSB_T32A15_DMAA_DMAENA2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAA,2)))
#define TSB_T32A15_RUNB_RUNB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNB,0)))
#define TSB_T32A15_RUNB_SFTSTAB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNB,1)))
#define TSB_T32A15_RUNB_SFTSTPB                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNB,2)))
#define TSB_T32A15_RUNB_RUNFLGB                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNB,4)))
#define TSB_T32A15_CRB_WBFB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->CRB,20)))
#define TSB_T32A15_STB_INTB0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STB,0)))
#define TSB_T32A15_STB_INTB1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STB,1)))
#define TSB_T32A15_STB_INTOFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STB,2)))
#define TSB_T32A15_STB_INTUFB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STB,3)))
#define TSB_T32A15_IMB_IMB0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMB,0)))
#define TSB_T32A15_IMB_IMB1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMB,1)))
#define TSB_T32A15_IMB_IMOFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMB,2)))
#define TSB_T32A15_IMB_IMUFB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMB,3)))
#define TSB_T32A15_DMAB_DMAENB0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAB,0)))
#define TSB_T32A15_DMAB_DMAENB1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAB,1)))
#define TSB_T32A15_DMAB_DMAENB2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAB,2)))
#define TSB_T32A15_RUNC_RUNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNC,0)))
#define TSB_T32A15_RUNC_SFTSTAC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNC,1)))
#define TSB_T32A15_RUNC_SFTSTPC                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNC,2)))
#define TSB_T32A15_RUNC_RUNFLGC                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_T32A15->RUNC,4)))
#define TSB_T32A15_CRC_WBFC                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->CRC,20)))
#define TSB_T32A15_STC_INTC0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STC,0)))
#define TSB_T32A15_STC_INTC1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STC,1)))
#define TSB_T32A15_STC_INTOFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STC,2)))
#define TSB_T32A15_STC_INTUFC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STC,3)))
#define TSB_T32A15_STC_INTSTERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->STC,4)))
#define TSB_T32A15_IMC_IMC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMC,0)))
#define TSB_T32A15_IMC_IMC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMC,1)))
#define TSB_T32A15_IMC_IMOFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMC,2)))
#define TSB_T32A15_IMC_IMUFC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMC,3)))
#define TSB_T32A15_IMC_IMSTERR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->IMC,4)))
#define TSB_T32A15_DMAC_DMAENC0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAC,0)))
#define TSB_T32A15_DMAC_DMAENC1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAC,1)))
#define TSB_T32A15_DMAC_DMAENC2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->DMAC,2)))
#define TSB_T32A15_PLSCR_PMODE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->PLSCR,0)))
#define TSB_T32A15_PLSCR_PDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_T32A15->PLSCR,1)))


