MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4GNFDFG/mcu.h
#define TSB_EI2C2_AEN_I2CM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AEN,0)))
#define TSB_EI2C2_ACR0_ALE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,0)))
#define TSB_EI2C2_ACR0_GCE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,1)))
#define TSB_EI2C2_ACR0_NACKE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,2)))
#define TSB_EI2C2_ACR0_ESTE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,3)))
#define TSB_EI2C2_ACR0_ESPE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,4)))
#define TSB_EI2C2_ACR0_TOE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,8)))
#define TSB_EI2C2_ACR0_NFSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR0,11)))
#define TSB_EI2C2_ACR1_ST                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,0)))
#define TSB_EI2C2_ACR1_RS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,1)))
#define TSB_EI2C2_ACR1_SP                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,2)))
#define TSB_EI2C2_ACR1_ACKSEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,3)))
#define TSB_EI2C2_ACR1_ACKWAIT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,4)))
#define TSB_EI2C2_ACR1_OMC                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ACR1,10)))
#define TSB_EI2C2_ASR0_ACKF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR0,0)))
#define TSB_EI2C2_ASR0_BB                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR0,1)))
#define TSB_EI2C2_ASR0_TRX                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR0,2)))
#define TSB_EI2C2_ASR0_MST                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR0,3)))
#define TSB_EI2C2_ASR1_STCF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,0)))
#define TSB_EI2C2_ASR1_RSCF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,1)))
#define TSB_EI2C2_ASR1_SPCF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,2)))
#define TSB_EI2C2_ASR1_TEND                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,3)))
#define TSB_EI2C2_ASR1_TBE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,4)))
#define TSB_EI2C2_ASR1_RBF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,5)))
#define TSB_EI2C2_ASR1_NACK                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,6)))
#define TSB_EI2C2_ASR1_AL                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,7)))
#define TSB_EI2C2_ASR1_GC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,8)))
#define TSB_EI2C2_ASR1_AAS1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,9)))
#define TSB_EI2C2_ASR1_AAS2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,10)))
#define TSB_EI2C2_ASR1_EST                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,11)))
#define TSB_EI2C2_ASR1_ESP                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,12)))
#define TSB_EI2C2_ASR1_TOERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->ASR1,13)))
#define TSB_EI2C2_AAR1_SA1E                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AAR1,0)))
#define TSB_EI2C2_AAR1_SAFS1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AAR1,15)))
#define TSB_EI2C2_AAR2_SA2E                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AAR2,0)))
#define TSB_EI2C2_AAR2_SAFS2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AAR2,15)))
#define TSB_EI2C2_AIE_INTSTE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,0)))
#define TSB_EI2C2_AIE_INTRSE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,1)))
#define TSB_EI2C2_AIE_INTSPE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,2)))
#define TSB_EI2C2_AIE_INTNACKE                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,6)))
#define TSB_EI2C2_AIE_INTALE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,7)))
#define TSB_EI2C2_AIE_INTGCE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,8)))
#define TSB_EI2C2_AIE_INTASE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,9)))
#define TSB_EI2C2_AIE_INTESTE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,11)))
#define TSB_EI2C2_AIE_INTESPE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,12)))
#define TSB_EI2C2_AIE_INTTOE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,13)))
#define TSB_EI2C2_AIE_DMATX                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,14)))
#define TSB_EI2C2_AIE_DMARX                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EI2C2->AIE,15)))
#define TSB_EI2C2_APM_SCL                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->APM,0)))
#define TSB_EI2C2_APM_SDA                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->APM,1)))
#define TSB_EI2C2_APM_SCLOUT                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->APM,2)))
#define TSB_EI2C2_APM_SDAOUT                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EI2C2->APM,3)))


/* Finite Impulse Response */
#define TSB_FIRnore_START_START                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->START,0)))
#define TSB_FIRnore_CTRL_ODATAFMT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->CTRL,28)))
#define TSB_FIRnore_INITIALIZE_INITIALIZE         (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->INITIALIZE,0)))
#define TSB_FIRnore_INTEN_IDATAWREQ               (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->INTEN,0)))
#define TSB_FIRnore_INTEN_ODATARREQ               (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->INTEN,1)))
#define TSB_FIRnore_INTEN_OVERFLOW                (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->INTEN,2)))
#define TSB_FIRnore_DMAEN_IDATAWREQ               (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->DMAEN,0)))
#define TSB_FIRnore_DMAEN_ODATARREQ               (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->DMAEN,1)))
#define TSB_FIRnore_RAWINTSTAT_IDATAWREQ          (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->RAWINTSTAT,0)))
#define TSB_FIRnore_RAWINTSTAT_ODATARREQ          (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->RAWINTSTAT,1)))
#define TSB_FIRnore_RAWINTSTAT_OVERFLOW           (*((__IO uint32_t *)BITBAND_PERI(&TSB_FIRnore->RAWINTSTAT,2)))


